tests/src/Mock/AuthoriseCaptureSuccess.http

HTTP/1.1 200 OK
Server: Apache-Coyote/1.1
PROXY_SERVER_INFO: host=slcsbjava4.slc.paypal.com;threadId=183404
Paypal-Debug-Id: 05ff075244bac
SERVER_INFO: paymentsplatformserv:v1.payments.authorization&CalThreadId=6792&TopLevelTxnStartTime=14919a2eb03&Host=slcsbpaymentsplatformserv3002.slc.paypal.com&pid=14199
Content-Language: *
Date: Thu, 16 Oct 2014 15:45:49 GMT
Content-Type: application/json
Content-Length: 724

{"id":"1D2800957K044141A","create_time":"2014-10-16T15:45:47Z","update_time":"2014-10-16T15:45:49Z","amount":{"total":"3.00","currency":"USD"},"is_final_capture":false,"state":"completed","parent_payment":"PAY-8GM471425F0162713KQ75RMA","links":[{"href":"https://api.sandbox.paypal.com/v1/payments/capture/1D2800957K044141A","rel":"self","method":"GET"},{"href":"https://api.sandbox.paypal.com/v1/payments/capture/1D2800957K044141A/refund","rel":"refund","method":"POST"},{"href":"https://api.sandbox.paypal.com/v1/payments/authorization/9HJ30098MP9464308","rel":"authorization","method":"GET"},{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-8GM471425F0162713KQ75RMA","rel":"parent_payment","method":"GET"}]}
