tests/src/Mock/AuthoriseCreditCardSuccess.http

HTTP/1.1 201 Created
Server: Apache-Coyote/1.1
PROXY_SERVER_INFO: host=slcsbjava1.slc.paypal.com;threadId=1463
Paypal-Debug-Id: f5296e4c059b2
SERVER_INFO: paymentsplatformserv:v1.payments.payment&CalThreadId=201&TopLevelTxnStartTime=14919667284&Host=slcsbjm1.slc.paypal.com&pid=29665
Content-Language: *
Date: Thu, 16 Oct 2014 14:39:46 GMT
Content-Type: application/json
Content-Length: 1536

{"id":"PAY-8GM471425F0162713KQ75RMA","create_time":"2014-10-16T14:39:44Z","update_time":"2014-10-16T14:39:46Z","state":"approved","intent":"authorize","payer":{"payment_method":"credit_card","funding_instruments":[{"credit_card":{"type":"visa","number":"xxxxxxxxxxxx1111","expire_month":"4","expire_year":"2018","first_name":"Test","last_name":"User1","billing_address":{"line1":"123 Billing St","line2":"Billsville","city":"Billstown","state":"CA","postal_code":"12345","country_code":"US"}}}]},"transactions":[{"amount":{"total":"3.00","currency":"USD","details":{"subtotal":"3.00"}},"related_resources":[{"authorization":{"id":"9HJ30098MP9464308","create_time":"2014-10-16T14:39:44Z","update_time":"2014-10-16T14:39:46Z","amount":{"total":"3.00","currency":"USD","details":{"subtotal":"3.00"}},"state":"authorized","parent_payment":"PAY-8GM471425F0162713KQ75RMA","valid_until":"2014-11-14T14:39:44Z","links":[{"href":"https://api.sandbox.paypal.com/v1/payments/authorization/9HJ30098MP9464308","rel":"self","method":"GET"},{"href":"https://api.sandbox.paypal.com/v1/payments/authorization/9HJ30098MP9464308/capture","rel":"capture","method":"POST"},{"href":"https://api.sandbox.paypal.com/v1/payments/authorization/9HJ30098MP9464308/void","rel":"void","method":"POST"},{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-8GM471425F0162713KQ75RMA","rel":"parent_payment","method":"GET"}]}}]}],"links":[{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-8GM471425F0162713KQ75RMA","rel":"self","method":"GET"}]}
