tests/src/Mock/AuthorisePaypalSuccess.http

HTTP/1.1 201 Created
Server: Apache-Coyote/1.1
PROXY_SERVER_INFO: host=slcsbplatformapiserv3002.slc.paypal.com;threadId=45034
Paypal-Debug-Id: c84467e42dc00
SERVER_INFO: paymentsplatformserv:v1.payments.payment&CalThreadId=167&TopLevelTxnStartTime=1491933e284&Host=slcsbpaymentsplatformserv3001.slc.paypal.com&pid=31898
Content-Language: *
Date: Thu, 16 Oct 2014 13:44:30 GMT
Content-Type: application/json
Content-Length: 747

{"id":"PAY-2LY017912Y929154HKQ74XPY","create_time":"2014-10-16T13:44:31Z","update_time":"2014-10-16T13:44:31Z","state":"created","intent":"authorize","payer":{"payment_method":"paypal","payer_info":{"shipping_address":{}}},"transactions":[{"amount":{"total":"15.00","currency":"GBP","details":{"subtotal":"15.00"}},"related_resources":[]}],"links":[{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-2LY017912Y929154HKQ74XPY","rel":"self","method":"GET"},{"href":"https://www.sandbox.paypal.com/cgi-bin/webscr?cmd=_express-checkout&token=EC-5SD087658M435925N","rel":"approval_url","method":"REDIRECT"},{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-2LY017912Y929154HKQ74XPY/execute","rel":"execute","method":"POST"}]}
