tests/src/Mock/AuthoriseVoidSuccess.http

HTTP/1.1 200 OK
Server: Apache-Coyote/1.1
PROXY_SERVER_INFO: host=slcsbjava1.slc.paypal.com;threadId=168562
Paypal-Debug-Id: b0dd85d84d411
SERVER_INFO: paymentsplatformserv:v1.payments.authorization&CalThreadId=90&TopLevelTxnStartTime=14919b2ee13&Host=slcsbpaymentsplatformserv3001.slc.paypal.com&pid=31898
Content-Language: *
Date: Thu, 16 Oct 2014 16:03:17 GMT
Content-Type: application/json
Content-Length: 493

{"id":"1SN458127W2399139","create_time":"2014-10-16T13:44:31Z","update_time":"2014-10-16T13:47:22Z","amount":{"total":"15.00","currency":"GBP","details":{"subtotal":"15.00"}},"state":"voided","parent_payment":"PAY-2LY017912Y929154HKQ74XPY","links":[{"href":"https://api.sandbox.paypal.com/v1/payments/authorization/1SN458127W2399139","rel":"self","method":"GET"},{"href":"https://api.sandbox.paypal.com/v1/payments/payment/PAY-2LY017912Y929154HKQ74XPY","rel":"parent_payment","method":"GET"}]}
